# Questions_List format is {question entry: answer list
questions_list = {
    "Ваш коллега хочет открыть вклад в банке":
        [
            "Нет, он может воспользоваться финансовым маркетплейсом"
        ],

    "Вы пошли в магазин и забыли дома банковскую карту":
        [
            "Необязательно, надо уточнить на кассе, можно ли провести оплату по QR-коду по Системе быстрых платежей (СБП)"],

    "Ваша знакомая рассказала вам, что ее тетя в прошлом году потратила на лечение 120 тыс":
        ["Да, в этом случае она может вернуть уплаченный налог ровно с той суммы, которую потратила"],

    "Ваш сосед попал в аварию, у него и второго участника оформлены полисы ОСАГО":
        ["400 тыс. рублей"],

    "Ваш сосед хочет взять ипотеку на покупку квартиры":
        [
            "При покупке жилья на Дальнем Востоке",
            'В случае, если у семьи недавно родился (или родится) ребенок',
            'При покупке квартиры на вторичном рынке независимо от любых обстоятельств'
        ],

    "Вы решили взять ипотеку":
        [
            'На полную стоимость кредита'
        ],

    "У вашей сестры есть подушка безопасности, которая лежит на вкладе в банке, и оплаченный полис страхования жизни на 10 лет вперед":
        [
            "К брокеру — он подскажет, как грамотно распорядиться средствами и куда лучше инвестировать"
        ],

    "У вашего друга возникли финансовые трудности":
        [
            "При нахождении на больничном более двух месяцев подряд",
            'При потере работы',
            'При оформлении второго ипотечного кредита',
            'При снижении ежемесячных доходов более чем на 30%'

        ],

    'Ваш коллега хочет открыть вклад в банке':
        ['Нет, он может воспользоваться финансовым маркетплейсом'],

    r"Ваш друг рассказал вам, что неквалифицированный инвестор может купить некоторые финансовые инструменты на бирже только после специального тестирования":
        [
            'Тест на психологическую готовность к совершению сделок'
        ],

    # 'Вам поздно вечером звонит родственник и срочно просит перевести ему деньги':
    'Вам поздно вечером звонит родственник и срочно просит перевести ему деньги':
        [
            # Правильный Конечно, Система быстрых платежей (СБП) работает в режиме 24/7
            r'Нет, к сожалению, придется подождать до утра'
        ],

    r'Вы решили составить личный финансовый план':
        [
            'Нет'
        ],

    "Вам поступил звонок от сотрудника банка с просьбой подтвердить перевод на вашу карту":
        [
            # Положу трубку, ведь сотрудник банка никогда не запрашивает эти данные
            "Продолжу разговор и уточню детали операции"
        ],

    'У вас есть не только страховая часть пенсии, но и пенсионные накопления':
        [
            'На портале «Госуслуги»',
            'В Пенсионном фонде России',
            'В Фонде социального страхования'
        ],

    'Вы оплачиваете коммунальные платежи через «Госуслуги»':
        [
            # Не буду переходить по ссылке: «Госуслуги» не делают рассылку на мессенджеры. Прежде всего проверю доступ к своему аккаунту на «Госуслугах»
            'Это, скорее всего, мошенники, но ради любопытства перейду по ссылке'
        ],

    'Ваш друг не согласен с суммой выплаченных банком процентов по вкладу':
        [
            'Да, этот спор как раз для финансового уполномоченного'
        ],

    'Ваша подруга решила, что хочет начать инвестировать':
        [
            # Скорее всего, нет, так как успех брата в прошлом не гарантирует такого же успеха у подруги в будущем
            'Конечно, у брата же получилось, значит, и у нее точно получится'
        ],

    'Ваша знакомая решила приобрести структурные облигации':
        [
            'Лучше пока отказаться от покупки сложных финансовых инструментов и дополнительно подготовиться к тесту'
        ],

    'Ваша знакомая постоянно делает покупки на всю семью':
        [
            # Да, личная инфляция у каждого своя, и она не всегда равна официальной
            'Нет, конечно, она что-то путает'
        ],

    'Ваш пожилой родственник получает пенсию на карту и переживает, что деньги с нее могут украсть мошенники через мобильный банк':
        [
            'Да, надо подключить сервис «второй руки», и тогда я как доверенное лицо смогу подтверждать или отклонять операции родственника'
        ],

    'Вы хотите перевести деньги другу по Системе быстрых платежей (СБП)':
        [
            # 'Нет, без комиссий вы можете переводить до 100 тыс. рублей в месяц.'
            'Да, по Системе быстрых платежей (СБП) можно переводить любые суммы без комиссий.'
        ],

}